$ sw_vers
ProductName:	Mac OS X
ProductVersion:	10.12.6
BuildVersion:	16G29

$ lldb /Library/Developer/KDKs/KDK_10.12.6_16G29.kdk/System/Library/Kernels/kernel.debug
(lldb) showlldbtypesummaries
...
(lldb) kdp-remote 172.16.41.129
...
(lldb) bt
* thread #2, name = '0xffffff8034faabf0', queue = '0x0', stop reason = signal SIGSTOP
  * frame #0: 0xffffff801dcaaa06 kernel.debug`strlcpy(dst="0x37cf78b0", src="0x37cf78b0>>ï¾­?"..., siz=11) at subrs.c:521
    frame #1: 0xffffff801e3d12b7 kernel.debug`_encode_data(content=0xffffff823b233d1a, arg=0xffffff8037cf78b0, arg_len=11, context=0xffffff823b233b60) at log_encode.h:64
    frame #2: 0xffffff801e3d06a9 kernel.debug`_os_log_encode [inlined] _os_log_encode_arg(arg=0xffffff8037cf78b0, arg_len=11, ctype='\x02', is_private=false, context=0xffffff823b233b60) at log_encode.h:208
    frame #3: 0xffffff801e3d03d1 kernel.debug`_os_log_encode(format="xnu_printf_prec_panic: [DBG] %llu: %.*s\n", args=0xffffff823b233be0, saved_errno=0, context=0xffffff823b233b60) at log_encode.h:457
    frame #4: 0xffffff801e3cd137 kernel.debug`_os_log_to_log_internal(oslog=0xffffff801e7074c0, type='\0', format="xnu_printf_prec_panic: [DBG] %llu: %.*s\n", args=0xffffff823b233f50, addr=0xffffff7fa0134c7c, dso=0xffffff7fa0134000) at log.c:292
    frame #5: 0xffffff801e3c9b1d kernel.debug`_os_log_with_args_internal(oslog=0xffffff801e7074c0, type='\0', format="xnu_printf_prec_panic: [DBG] %llu: %.*s\n", args=0xffffff823b233f50, addr=0xffffff7fa0134c7c, dso=0x0000000000000000) at log.c:178
    frame #6: 0xffffff801e3c9b8b kernel.debug`os_log_with_args(oslog=0xffffff801e7074c0, type='\0', format="xnu_printf_prec_panic: [DBG] %llu: %.*s\n", args=0xffffff823b233f50, addr=0xffffff7fa0134c7c) at log.c:155
    frame #7: 0xffffff801db511a0 kernel.debug`vprintf_internal(fmt="xnu_printf_prec_panic: [DBG] %llu: %.*s\n", ap_in=0xffffff823b233f50, caller=0xffffff7fa0134c7c) at printf.c:828
    frame #8: 0xffffff801db51002 kernel.debug`printf(fmt="xnu_printf_prec_panic: [DBG] %llu: %.*s\n") at printf.c:842
    frame #9: 0xffffff7fa0134c7c xnu_printf_prec_panic`thread_runloop [inlined] printf_prec_panic_test at xnu_printf_prec_panic.c:51 [opt]
    frame #10: 0xffffff7fa0134bbe xnu_printf_prec_panic`thread_runloop(arg=<unavailable>, wres=<unavailable>) at xnu_printf_prec_panic.c:82 [opt]
    frame #11: 0xffffff801dd01777 kernel.debug`call_continuation + 23

(lldb) register read
General Purpose Registers:
       rax = 0xffffff8037cf8000
       rbx = 0xffffff7fa01350e8  thread_runloop.ts
       rcx = 0xffffff8037cf8001
       rdx = 0x0000000000000030
       rdi = 0xffffff823b233c00
       rsi = 0x0000000000000030
       rbp = 0xffffff823b2330f0
       rsp = 0xffffff823b2330c0
        r8 = 0xffffff823b233a00
        r9 = 0x0000000000000002
       r10 = 0xffffff802d60000b
       r11 = 0xffffff823b233d1a
       r12 = 0xffffff7fa0134f81  "printf_prec_panic_test"
       r13 = 0xffffff8037cf78b0
       r14 = 0xffffff7fa0134e6d  "src/xnu_printf_prec_panic.c"
       r15 = 0xffffff7fa0135008  cond_keepalive
       rip = 0xffffff801dcaaa06  kernel.debug`strlcpy + 214 at subrs.c:521
    rflags = 0x0000000000010282
        cs = 0x0000000000000008
        fs = 0x00000000ffff0000
        gs = 0x0000000037cf0000

(lldb) up 9
xnu_printf_prec_panic was compiled with optimization - stepping may behave oddly; variables may not be available.
frame #9: 0xffffff7fa0134c7c xnu_printf_prec_panic`thread_runloop [inlined] printf_prec_panic_test at xnu_printf_prec_panic.c:51 [opt]
   48  	    p[fixed] = '>';
   49  	    p[fixed+1] = '>';
   50  	
-> 51  	    LOG_DBG("%llu: %.*s", i, sz-1, p);
   52  	
   53  	#if PANIC_QUICKLY
   54  	    /**

(lldb) register read
General Purpose Registers:
       rbx = 0xffffff7fa01350e8  thread_runloop.ts
       rbp = 0xffffff823b233fb0
       rsp = 0xffffff823b233f80
       r12 = 0xffffff7fa0134f81  "printf_prec_panic_test"
       r13 = 0xffffff8037cf78b0
       r14 = 0xffffff7fa0134e6d  "src/xnu_printf_prec_panic.c"
       r15 = 0xffffff7fa0135008  cond_keepalive
       rip = 0xffffff7fa0134c7c  xnu_printf_prec_panic`thread_runloop + 245 [inlined] printf_prec_panic_test + 190 at xnu_printf_prec_panic.c:82
  xnu_printf_prec_panic`thread_runloop + 55 at xnu_printf_prec_panic.c:82
13 registers were unavailable.

(lldb) showbootargs
debug=0x144 kext-dev-mode=1 kcsuffix=debug pmuflags=1 -v

(lldb) showversion
Darwin Kernel Version 16.7.0: Thu Jun 15 17:35:41 PDT 2017; root:xnu_debug-3789.70.16~1/DEBUG_X86_64

